Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/installer-omegat.tmx
Source language: en_us
Languages: pt_br

source: NetBeans IDE {display-version}
pt_br: IDE NetBeans {display-version}

source: Runtimes
pt_br: Tempo de execução

source: Removing files irrelevant to the current platform
pt_br: Removendo arquivos desnecessários para a plataforma atual

source: Correcting files permissions
pt_br: Corrigindo permissões de arquivos

source: Integrating Apache Tomcat {display-version} with existing NetBeans IDEs
pt_br: Integrando o Apache Tomcat {display-version} com IDEs NetBeans existentes

source: Cannot completely remove irrelevant files
pt_br: Não foi possível remover os arquivos desnecessários

source: Cannot completely correct files permissions
pt_br: Não foi possível corrigir as permissões dos arquivos

source: Failed to integrate Apache Tomcat {display-version} with existing NetBeans IDEs
pt_br: Falha ao integrar o Apache Tomcat {display-version} com IDEs NetBeans existentes

source: Removing Apache Tomcat {display-version} IDE integration
pt_br: Removendo integração do Apache Tomcat {display-version} com IDEs NetBeans existentes

source: Failed to remove Apache Tomcat {display-version} IDE integration
pt_br: Falha ao remover a integração do Apache Tomcat {display-version} com o IDE

source: Apache Tomcat {display-version} Installation
pt_br: Instação do Apache Tomcat {display-version}

source: Choose destination folder.
pt_br: Escolha a pasta de destino.

source: &Install Apache Tomcat to:
pt_br: &Instalar o Apache Tomcat em:

source: B&rowse.....
pt_br: P&rocurar.....

source: Free, open source web server that is the reference implementation for Java servlet and JSP specifications.
pt_br: Servidor web de código-fonte aberto que é implementação da referência de servlet Java e especificações JSP.

source: Setting the appropriate JDK home
pt_br: Definindo local home apropriado para o JDK

source: Adding IDE clusters to the active clusters list
pt_br: Adicionando clusters IDE a lista de clusters ativa

source: Creating the productid file
pt_br: Criando arquivo id do produto

source: Creating the license_accepted marker file
pt_br: Criando arquivo de marcação de aceitação de licensa

source: Creating desktop shortcut
pt_br: Criando atalhos da Área de Trabalho

source: Creating Start Menu entries
pt_br: Criando entradas do Menu Iniciar

source: Updating the netbeans.conf file
pt_br: Atualizando o arquivo netbeans.conf

source: Integrating the IDE with existing GlassFish installations
pt_br: Integrando a IDE com instalações existes do GlassFish

source: Integrating the IDE with existing Apache Tomcat installations
pt_br: Integrando a IDE com instalações existentes do Apache Tomcat

source: Removing the license_accepted marker file
pt_br: Removendo o arquivo de marcação de licensa

source: Removing the productid file
pt_br: Removendo o arquivo productid

source: Removing desktop shortcut
pt_br: Removendo atalhos da área de trabalho

source: Removing Start Menu entries
pt_br: Removendo entradas do Menu Iniciar

source: Cannot set the selected JDK home
pt_br: Não foi possível aplicar o local padrão selecionado para o JDK

source: Cannot add NetBeans IDE clusters to the active clusters list
pt_br: Não foi possível adicionar os cluster do NetBeans IDE á lista de clusters

source: Cannot create the productid file
pt_br: Não foi possível criar o arquivo de id do produto

source: Cannot create the license_accepted marker file
pt_br: Não foi possível criar o arquivo de marcação de licensa

source: Cannot create desktop shortcut
pt_br: Não foi possível criar os atalhos da área de trabalho

source: Cannot create Start Menu entries
pt_br: Não foi possível criar as entradas do Menu Iniciar

source: Cannot update the netbeans.conf file
pt_br: Não foi possivel atualizar o arquivo netbeans.conf

source: Failed to integrate the IDE with existing GlassFish installations
pt_br: Falha ao integrar a IDE instalações existentes do GlassFish

source: Failed to integrate the IDE with existing Apache Tomcat installations
pt_br: Falha ao integrar a IDE com instalações existente do Apache Tomcat

source: Cannot remove the license_accepted marker file
pt_br: Não foi possível remover o arquivo de marcação de licensa

source: Cannot remove the productid file
pt_br: Não foi possível remover o arquivo de id do produto

source: Cannot remove desktop shortcut
pt_br: Não foi possível remover os atalhos da área de trabalho

source: Cannot remove Start Menu entries
pt_br: Não foi possível remover as entradas do Menu Iniciar

source: It appears that an instance of the IDE is still running: a lock file exists at {0} Please close all instances of the IDE prior to continuing with uninstallation.
pt_br: Aparentemente uma cópia da IDE ainda está em execussão: um bloqueio de arquivo existe em {0} Por favor, feche todas as cópias da IDE para continuar com a desinstalação.

source: Can`t determine netbeans userdir so can`t check whether NetBeans IDE is running or not
pt_br: Não foi possível resolver o diretório padrão do usuário, assim não foi possível verificar se a IDE NetBeans está sendo executada ou não

source: The only IDE you need
pt_br: A única IDE que você precisa

source: NetBeans IDE {display-version} Installation
pt_br: Instalação da IDE NetBeans {display-version}

source: Choose the installation folder and JDK™ for the NetBeans IDE.
pt_br: Selecione a pasta de instalação e o JDK™ para o IDE NetBeans.

source: &Install the NetBeans IDE to:
pt_br: &Instalar o IDE NetBeans em:

source: B&rowse...
pt_br: P&rocurar...

source: &JDK™ for the NetBeans IDE:
pt_br: &JDK™ para o IDE NetBeans:

source: Br&owse...
pt_br: Pr&ocurar...

source: Core components of an integrated development environment.
pt_br: Núcleo de componentes de uma ambiente de desenvolvimento integrado.

source: Cannot configure samples configuration properties
pt_br: Não foi possível configurar as propriedades dos exemplos

source: Java Platform, Enterprise Edition 5 Samples
pt_br: Exemplos do Java Platform, Enterprise Edition 5

source: Java EE 5 Samples demonstrate the technologies and features specific to the Java Platform, Enterprise Edition 5.
pt_br: Exemplos Java EE 5 demonstram as tecnologias e recursos específicos para a Plataforma Java Edição Enterprise 5.

source: The features include annotations, EJB 3.0, persistence, security, and many others.
pt_br: Os recursos incluem anotações, EJB 3.0, persistência, segurança e muitos outros.

source: Stopping the application server default domain
pt_br: Parando o domínio padrão do servidor de aplicação

source: Running Portlet Container installer
pt_br: Executando o instalador do Portlet Container

source: Failed to stop the application server default domain
pt_br: Falha ao parar a execução do domínio padrão do servidor de aplicativo

source: Failed to run Portlet Container installer
pt_br: Falha ao executar o instalador do Portlet Container

source: The Java Portlet Specification (JSR 168) is a standard for developing portal components with the Java programming language.
pt_br: A Java Portlet Specification (JSR 168) é um padrão para o desenvolvimento de componentes com a linguagem de programação Java.

source: The Portlet Container {display-version} not only implements the Java Portlet Specification, but also provides a portlet driver, a lightweight portlet rendering environment
pt_br: O Portlet Container {display-version} não somente implementa a especificação Java Portlet Specification, mas também fornece um driver de portlet, um leve ambiente de renderização de portlet

source: Can`t remove Mobility End-2-End file {0}
pt_br: Não foi possível remover arquivo de Mobilidade End-2-End {0}

source: Mobility
pt_br: Mobilidade

source: Comprehensive tool set for creating Java Micro Edition applications for cell phones and portable devices.
pt_br: Ferramenta para criação de aplicações Java Micro Edition para telefone celulares e dispositivos portáteis.

source: Includes visual designer, web services connection wizard, and tools for handling device fragmentation problems.
pt_br: Inclue desenvolvimento visual, Assistente de conexão de serviços web, e ferramentas para manipulação de problemas de fragmentação de dispositivo.

source: Stopping the glassfish default domain
pt_br: Parando o domínio padrão do glassfish

source: Running SWDP installer
pt_br: Executando instalador do SWDP

source: Running SWDP uninstaller
pt_br: Executando desinstalador do SWDP

source: Failed to stop the default glassfish domain
pt_br: Falha ao parar o domínio padrão do glassfish

source: Failed to run SWDP installer
pt_br: Falha ao executar o instalador do SWDP

source: Failed to run SWDP uninstaller
pt_br: Falha ao executar o desinstalador do SWDP

source: Sun Web Developer Pack {display-version}
pt_br: Pacote do Desenvolvedor Sun Web {display-version}

source: The Sun Web Developer Pack helps you to leverage emerging web technologies and techniques to create interactive and dynamic web applications for the enterprise.
pt_br: O Pacote do Desenvolvedor Sun Web ajuda você a alavancar tecnologias emergentes na web e técnicas para criar aplicações web dinâmicas e interativas para a empresa.

source: This toolkit is a collection of technologies for Ajax, Scripting and REST-based services development supported by a NetBeans plugin that simplifies the design and development of Rich Internet Applications.
pt_br: Estas ferramentas são um conjunto de tecnologias para o Ajax, Scripting e REST - serviços baseados desenvolvimento apoiado por um plugin NetBeans que simplifica a concepção e desenvolvimento de Aplicações Ricas para Internet.

source: Stopping the default domain
pt_br: Parando o domínio padrão

source: Running Access Manager installer
pt_br: Executando o instalador do Gerenciador de Acessos

source: Adding the quick startup jvm option
pt_br: Adicionando a opção de inicialização rápida da jvm

source: Starting the default domain
pt_br: Iniciando o domínio padrão

source: Removing the quick startup jvm option
pt_br: Removendo a opção de inicialização rápida da jvm

source: Deleting extra files created by Access Manager installer
pt_br: Removendo arquivos adicionais criados pelo instalador do Gerenciador de Acessos

source: Cannot find out which JDK is used by the hosting application server
pt_br: Não foi possível descobrir qual JDK é utilizado pela aplicação hospedagem do servidor

source: Failed to stop the default domain
pt_br: Falha ao parar o domínio padrão

source: Failed to run Access Manager installer
pt_br: Falha ao executar o instalador do Gerenciador de Acessos

source: Failed to add the quick startup jvm option
pt_br: Falha ao adicionar a opção de inicialização rápida da jvm

source: Failed to start the default domain
pt_br: Falha ao iniciar o domínio padrão

source: Failed to remove the quick startup jvm option
pt_br: Falha ao remover a opção de inicialização rápida da jvm

source: Failed to delete extra files created by Access Manager installer
pt_br: Falha ao remover os arquivos adicionais criados pelo instalador do Gerenciador de Acessos

source: Sun Java System Access Manager 7.1 integrates authentication and authorization services, policy agents, and identity federation to provide a comprehensive solution for protecting network resources.
pt_br: Sun Java System Access Manager 7.1 integra serviços de autenticação e autorização, agentes de política, e identidade federativa para prover uma abrangente solução de proteção de recursos de rede.

source: These functions allow an Access Manager deployment to prevent unauthorized access to web service applications and web content.
pt_br: Estas funções permitem uma implantação de um Gerenciador de Acessos para impedir o acesso não autorizado á aplicações de serviço web e conteúdo web.

source: Creating configuration files from templates
pt_br: Criando arquivos de configuração de modelos

source: Creating the default domain
pt_br: Criando domínio padrão

source: Adding some extra files to the installed files list
pt_br: Adicionando arquivos extra para a lista de arquivos instalados

source: Integrating Application Server {display-version} with existing NetBeans IDEs
pt_br: Integrando Application Server {display-version} com IDEs NetBeans existentes

source: Creating Application Server shortcuts
pt_br: Criando atalhos do Servidor de aplicação

source: About Application Server PE
pt_br: Sobre o Servidor de aplicação PE

source: Quick Start Guide
pt_br: Guia de início rápido

source: Online Documentation
pt_br: Documentação online

source: Start Default Server
pt_br: Inicializar o servidor padrão

source: Start Java DB
pt_br: Inicializar Java DB

source: Stop Default Server
pt_br: Parar servidor padrão

source: Stop Java DB
pt_br: Parar Java DB

source: Sample Applications
pt_br: Aplicativos de exemplo

source: Removing Application Server {display-version} integration from NetBeans IDEs
pt_br: Removendo integração do Servidor de Aplicação {display-version} com IDEs NetBeans existentes

source: Deleting the default domain
pt_br: Removendo o domínio padrão

source: Removing Application Server {display-version} shortcuts
pt_br: Removendo atalhos do Servidor de Aplicação {display-version}

source: Failed to create configuration files from templates
pt_br: Falha ao criar os arquivos de configuração de modelos

source: Failed to create the default domain
pt_br: Falha ao criar o domínio padrão

source: Failed to add extra files to the installed files list
pt_br: Falha ao adicionar os arquivos extras na lista de arquivos instalados

source: Failed to integrate Application Server {display-version} with existing NetBeans IDEs
pt_br: Falha na integração do Servidor de Aplicação {display-version} com IDEs NetBeans existentes

source: Failed to create Application Server shortcuts
pt_br: Falha ao criar os atalhos do Servidor de Aplicação

source: Failed to create Legal files
pt_br: Falha ao criar os arquivos Legais

source: Failed to remove Application Server {display-version} integration from NetBeans IDEs
pt_br: Falha ao remover a integração do Servidor de Aplicação {display-version} com IDEs NetBeans existentes

source: Failed to delete the default domain
pt_br: Falha ao criar o domínio padrão

source: Failed to remove Application Server shortcuts
pt_br: Falha ao remover os atalhos do Servidor de Aplicação

source: Sun Java System Application Server {display-version} Installation
pt_br: Instalação do Sun Java System Application Server {display-version}

source: Choose the installation folder and server properties.
pt_br: Selecione a pasta de instalação e as propriedades do Servidor.

source: &Install Sun Java System Application Server {display-version} to:
pt_br: &Instalar o Sun Java System Application Server {display-version} em:

source: &JDK™ for application server:
pt_br: &JDK™ para o servidor de aplicação:

source: Admin &Username:
pt_br: &Usuário admin:

source: Admin &Password:
pt_br: Senha &Admin:

source: R&etype Password:
pt_br: R&epita a Senha:

source: H&TTP Port:
pt_br: Porta H&TTP:

source: HTTP&S Port:
pt_br: Porta HTTP&S:

source: &Admin Port:
pt_br: Porta A&dmin:

source: Username cannot be empty.
pt_br: O nome de Usuário deve ser informado.

source: Username "{0}" is invalid.
pt_br: Nome de usuário "{0}" é inválido.

source: Username should be an alphanumeric string.
pt_br: Nome de Usuário deve ser alfa-numérico.

source: Password cannot be null.
pt_br: Você deve digitar uma senha.

source: Password should be at least 8 characters long.
pt_br: A Senha deve conter pelo menos 8 caracteres.

source: Password cannot start or end with whitespace characters.
pt_br: A Senha não deve iniciar ou terminar com espaços.

source: The passwords do not match.
pt_br: As senhas informadas não coincidem.

source: HTTP port cannot be empty.
pt_br: Porta HTTP deve ser informada.

source: HTTPS port cannot be empty.
pt_br: Porta HTTPS deve ser informada.

source: Admin port cannot be empty.
pt_br: Porta Admin deve ser informada.

source: HTTP port "{0}" is invalid.
pt_br: Porta HTTP "{0}" é inválida.

source: HTTP port should be an integer from 1 to 65535.
pt_br: Porta HTTP deve ser um valor inteiro de 1 à 65535.

source: HTTPS port "{0}" is invalid.
pt_br: Porta HTTPS "{0}" é inválida.

source: HTTPS port should be an integer from 1 to 65535.
pt_br: Porta HTTPS deve ser um valor inteiro de 1 à 65535.

source: Admin port "{0}" is invalid.
pt_br: Porta Admin "{0}" é inválida.

source: Admin port should be an integer from 1 to 65535.
pt_br: Porta Admin deve ser um valor inteiro de 1 à 65535.

source: HTTP port "{0}" is already occupied on this machine.
pt_br: A porta HTTP "{0}" já está sendo utilizada.

source: Please select another port.
pt_br: Por favor, selecione outra porta.

source: HTTPS port "{0}" is already occupied on this machine.
pt_br: A porta HTTPS "{0}" já está sendo utilizada.

source: Admin port "{0}" is already occupied on this machine.
pt_br: A porta Admin "{0}" já está sendo utilizada.

source: HTTP port value equals the HTTPS port value.
pt_br: O Valor da porta HTTP é igual ao valor da porta HTTPS.

source: They should be different.
pt_br: Selecione outro valor.

source: HTTP port value equals the Admin port value.
pt_br: A porta HTTP informada é igual Admin.

source: HTTPS port value equals the Admin port value.
pt_br: A porta HTTPS é igual ao valor da porta Admin.

source: All ports on your system are occupied.
pt_br: Todas as portas em seu sistema estão sendo utilizadas.

source: Please free at least 6 ports which can be used by the initial domain.
pt_br: Por favor, libere pelo menos 6 portas para ser utilizada pelo domínio padrão.

source: Port {0} is already in use by {1}, please select another value.
pt_br: A Porta {0} já está sendo usada por {1}, por favor, selecione outra porta.

source: Sun Java System Application Server {display-version}
pt_br: Servidor de Aplicação Sun Java System {display-version}

source: The Sun Java System Application Server 9.1 is a Java EE 5 platform-compatible server for the development and deployment of Java EE applications and Java technology-based web services in large-scale production environments.
pt_br: O Sun Java System Application Server 9.1 é um servidor compatível com a plataforma Java EE 5 para o desenvolvimento e implantação de aplicações baseadas na tecnologia Java EE e serviços web Java em ambientes de produção de larga escala.

source: Essential tools for programming in Java, including an editor, debugger, profiler, refactoring support, and award winning drag-and-drop GUI design tool (formerly known as Project Matisse).
pt_br: Ferramentas exenciais para programação em Java, incluíndo um editor, depurador, Profiler, suporte a refatoração, e uma ferramenta de desenvolvimento visual arrastar-e-soltar(mais conhecido como Projeto Matisse).

source: Integrating GlassFish {display-version} with existing NetBeans IDEs
pt_br: Integrando GlassFish {display-version} com as IDEs NetBeans existentes

source: Removing GlassFish {display-version} integration from NetBeans IDEs
pt_br: Removendo integração do GlassFish {display-version} com as IDEs NetBeans existentes

source: Deleting extra files
pt_br: Removendo arquivos extra

source: Failed to integrate GlassFish {display-version} with existing NetBeans IDEs
pt_br: Falha na integração do GlassFish {display-version} com as IDEs NetBeans existentes

source: Failed to remove GlassFish {display-version} integration from NetBeans IDEs
pt_br: Falha ao remover a integração do GlassFish {display-version} com as IDEs NetBeans existentes

source: Failed to delete extra files
pt_br: Falha ao excluir os arquivos extras

source: GlassFish {display-version} Installation
pt_br: Instalação do GlassFish {display-version}

source: &Install GlassFish to:
pt_br: &Instalar GlassFish em:

source: &JDK™ for GlassFish application server:
pt_br: &JDK™ para servidor de aplicação GlassFish:

source: Password cannot be empty.
pt_br: Por favor, informe a senha.

source: Specify another port.
pt_br: Especifique outra posta.

source: Port {0} is already in use by {1}.
pt_br: A porta {0} já está em uso por {1}.

source: Specify another value.
pt_br: Especifique outro valor.

source: Either .asadminpass or .asadmintruststore file exists in your home directory.
pt_br: Tanto o arquivo .asadminpass ou .asadmintruststore já existem em seu diretório de usuário.

source: Free, open source, production-quality application server that is also the reference implementation for Java EE 5 specification.
pt_br: Ferramenta de código-aberto, servidor de aplicação que está de acordo com a referência de implementação para a especificação Java EE 5.

source: Web & Java EE
pt_br: Web e Java EE

source: Tools for creating Java web and enterprise applications compatible with the J2EE 1.3, J2EE 1.4, and Java EE 5 specifications.
pt_br: Ferramentas para criação de aplicações Java web e enterprise compatíveis com especificações J2EE 1.3, J2EE 1.4, e Java EE 5.

source: Includes support for servlets, JSPs, tag libraries, Struts, Java Persistence API, Enterprise Java Beans, JAX-WS, and Java Server Faces.
pt_br: Inclue suporte a servlets, JSPs, bibliotecas de marcação, Struts, API Java de Persistência, Beans Enterprise Java, JAX-WS, e Java Server Faces.

source: Provides visual drag-and-drop application development environment.
pt_br: Fornece um ambiente visual de desenvolvimento de aplicações arrastar-e-soltar.

source: API documentation (Javadocs) {display-version}
pt_br: Documentação API (Javadocs) {display-version}

source: <no description>
pt_br: <sem descrição>

source: Error running NetBeans updater
pt_br: Erro ao executar o atualizador do NetBeans

source: Portal Pack Plugin
pt_br: Portal Pacote de Plugin

source: This module supports full life-cycle of portlet application development inside NetBeans.
pt_br: Este módulo suporta um completo ciclo de vida de desenvolvimento de uma aplicação portlet dentro do NetBeans.

source: Using this tool portlet developers can develop, package, deploy and test portlet inside their NetBeans IDE.
pt_br: Usando esta ferramenta os programadores podem desenvolver, pacotes, implantar e testar portlets dentro da IDE NetBeans.

source: By automatic code and Deployment Descriptor generation, this tool helps developers to develop portlets quickly.
pt_br: Através de código automático e a geração do Descritor de Implantação, esta ferramenta ajuda desenvolvedores a desenvolver rapidamente portlets.

source: It provides a tight integration with portal servers to support deployment and undeployment of portlets on both local and remote server.
pt_br: Ela oferece uma íntima integração com o Portal de servidores para apoiar à implantação e remoção de portlets tanto locamente como no servidor remoto.

source: Registering access manager runtime in the IDE
pt_br: Registrando gerenciador de acessos de tempo de execução na IDE

source: Removing access manager runtime registration from the IDE
pt_br: Removendo gerenciador de acesso de tempo de execução da IDE

source: Failed to register access manager runtime in the IDE
pt_br: Falha ao registrar gerenciador de acesso de tempo de execução na IDE

source: Failed to remove access manager runtime registration from the IDE
pt_br: Falha ao remover o gerenciador de acesso de tempo de execução da IDE

source: Tools for creating composite applications as part of a Service Oriented Architecture.
pt_br: Ferramentas para a criação de aplicações como parte de um Serviço Orientado a Arquitetura (SOA).

source: Provides comprehensive BPEL support.
pt_br: Fornece suporte a BPEL.

source: Includes graphical editor, debugger, and refactoring support.
pt_br: Inclui edit gráfico, depurador e suporte a refatoramento.

source: Your First Cup: An Introduction to the Java EE Platform {display-version}
pt_br: Seu primeiro contato: Uma introdução a plataforma Java EE {display-version}
